%WIENREG  Определение оптимального регулирующего воздействия по
% критерию минимума СКО при заданных спектрах уставки, помехи и
% известном объекте.
% Автор программы Елисеев В.Л. Дата 21 Декабря 1999 года. Версия 1.0
% Example:
%   Wy = tf(1, [1 1]); % Уставка
%   Wn = tf(0.2, 1);   % Помеха
%   Wo = tf(1, 1);     % Объект
%   [Wp, Wt] = WIENREG(Wy, Wn, Wo);
%   => Wp = tf(0.8198, [0.2 0.2]);
%      Wt = tf(0.8198, [0.2 1.02]);
function [Wp, Wt] = wienreg(Wy, Wn, Wo)

% Вычисление оптимальной передаточной функции всей системы
Wt = wiener(Wy, Wn, Wo);

% Wt = Nt / Dt
[Nt, Dt] = tfdata(Wt, 'v');
[Nt, Dt] = pqnorm(Nt, Dt);
%Nt = ppack(Nt);

% Вычисление передаточной функции регулятора
%        Wp * Wo                Wt
% Wt = ----------- => Wp = -------------
%      1 + Wp * Wo         Wo * (1 - Wt)
% или
%           Wt               Nt * Dt              Nt
% Wp = ------------- = ------------------- = --------------
%      Wo * (1 - Wt)   Dt * Wo * (Dt - Nt)   Wo * (Dt - Nt)
% или
%           Nt             Nt * Do
% Wp = -------------- = --------------
%      Wo * (Dt - Nt)   No * (Dt - Nt)

[No, Do] = tfdata(Wo, 'v');
Wp = tf(conv(Nt, Do), conv(No, psubs(Dt, Nt)));

% End of file